doc/td/td_surcharge_operateur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Surcharge d&rsquo;opérateur</title>
<!-- 2013-10-19 sam. 16:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><aa>Fraction de nombres complexes </aa><aa>Constructeur & destructeurs </aa><aa>Surcharge d'opérateur </aa><aa>Polymorphisme & classe abstraite </aa><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Surcharge d&rsquo;opérateur</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Surcharge des opérateurs <code>==</code> et <code>&lt;&lt;</code></h2>
<div class="outline-text-2" id="text-1">
<p>
À partir de la classe <code>Hasard</code> définie lors du TD précédent, remplacer la
méthode de comparaison par la surcharge de l&rsquo;opérateur <code>==</code>. On rappellera que
le type renvoyé est dans ce cas booléen.
</p>

<p>
De même, remplacer la méthode <code>Affiche()</code> qui présente l&rsquo;ensemble des valeurs
tirées aléatoirement par la surdéfinition de l&rsquo;opérateur <code>&lt;&lt;</code>. Dans ce but, le
type renvoyé sera <code>std::ostream</code> <i>i.e.</i> que l&rsquo;affichage se fera à
l&rsquo;écran, le prototype étant
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">friend</span> <span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-keyword">operator</span><span class="org-function-name">&lt;&lt;</span>(<span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-variable-name">os</span>, <span class="org-keyword">const</span> <span class="org-type">Hasard</span>&amp; <span class="org-variable-name">source</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Constructeur de recopie et accès mémoire</h2>
<div class="outline-text-2" id="text-2">
<p>
En utilisant la classe <code>Hasard</code>, créer au sein du programme principal, une
fonction <code>TestObjet</code> prenant pour argument un objet de type <code>Hasard</code> qui se
contentera d&rsquo;afficher un message à l&rsquo;écran. Aucune opération sur l&rsquo;objet ne sera
réalisée.
</p>

<p>
En parallèle, afficher, lors de la création et de la destruction d&rsquo;une instance
<code>Hasard</code>, l&rsquo;adresse de l&rsquo;objet courant de même que l&rsquo;adresse du pointeur de
nombre aléatoire. On s&rsquo;aidera du pointeur <code>this</code> pour cette opération.
</p>

<p>
Exécuter le programme principal, en créant une instance de la classe <code>Hasard</code>
puis en l&rsquo;utilisant au travers de la fonction <code>TestObjet</code>.
</p>

<p>
Résoudre la situation précédente en créant un constructeur de recopie. Que se
passe-t-il si l&rsquo;objet <code>Hasard</code> n&rsquo;est plus transmis par valeur mais pas
référence à la fonction <code>TestObjet</code> ?
</p>
</div>
</div>
</div>
</body>
</html>
